chore: revamped the docs and agent instruction folders
